#!/usr/bin/env bash
# File: /3c-eza/config/aliases.eza.sh
# ──────────────────────────────────────────────────────────────────────────────
# 😎📋 ALIAS management, for eza.
# ──────────────────────────────────────────────────────────────────────────────

## ─────────────────────────────────────────────────────────────────────────────
## 📃 Listing.
## ─────────────────────────────────────────────────────────────────────────────
alias la='eza --color=always --tree --level=1 --icons=always --all'
alias ll='eza --color=always --tree --level=1 --icons=always --long --group --git'
alias lla='eza --color=always --tree --level=1 --icons=always --all --long --group --git'
alias l='eza --color=always --tree --level=1 --icons=always'

